atanisoft/ESP32CommandStation/main/WebServer.cpp
/**********************************************************************
ESP32 COMMAND STATION

COPYRIGHT (c) 2017-2020 Mike Dunston

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.
  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.
  You should have received a copy of the GNU General Public License
  along with this program.  If not, see http://www.gnu.org/licenses
**********************************************************************/

#include "sdkconfig.h"
#include "ESP32TrainDatabase.h"

#include <AllTrainNodes.hxx>
#include <cJSON.h>
#include <DCCppProtocol.h>
#include <DCCProgrammer.h>
#include <dcc/Loco.hxx>
#include <Dnsd.h>
#include <DCCSignalVFS.h>
#include <esp_log.h>
#include <esp_ota_ops.h>
#include <FileSystemManager.h>
#include <freertos_drivers/esp32/Esp32WiFiManager.hxx>
#include <Httpd.h>
#include <JsonConstants.h>
#include <LCCStackManager.h>
#include <LCCWiFiManager.h>
#include <openlcb/MemoryConfigClient.hxx>
#include <mutex>
#include <Turnouts.h>
#include <utils/FileUtils.hxx>
#include <utils/SocketClientParams.hxx>
#include <utils/StringPrintf.hxx>
#include "OTAMonitor.h"

#if CONFIG_GPIO_OUTPUTS
#include <Outputs.h>
#endif // CONFIG_GPIO_OUTPUTS

#if CONFIG_GPIO_SENSORS
#include <Sensors.h>
#include <RemoteSensors.h>
#if CONFIG_GPIO_S88
#include <S88Sensors.h>
#endif // CONFIG_GPIO_S88
#endif // CONFIG_GPIO_SENSORS

using dcc::SpeedType;
using http::Httpd;
using http::HttpMethod;
using http::HttpRequest;
using http::HttpStatusCode;
using http::AbstractHttpResponse;
using http::StringResponse;
using http::JsonResponse;
using http::WebSocketFlow;
using http::MIME_TYPE_TEXT_HTML;
using http::MIME_TYPE_TEXT_JAVASCRIPT;
using http::MIME_TYPE_TEXT_PLAIN;
using http::MIME_TYPE_TEXT_XML;
using http::MIME_TYPE_TEXT_CSS;
using http::MIME_TYPE_IMAGE_PNG;
using http::MIME_TYPE_IMAGE_GIF;
using http::HTTP_ENCODING_GZIP;
using http::HTTP_ENCODING_NONE;
using http::WebSocketEvent;
using commandstation::AllTrainNodes;

class WebSocketClient : public DCCPPProtocolConsumer
{
public:
  WebSocketClient(int clientID, uint32_t remoteIP)
    : DCCPPProtocolConsumer(), _id(clientID), _remoteIP(remoteIP)
  {
    LOG(INFO, "[WS %s] Connected", name().c_str());
  }
  virtual ~WebSocketClient()
  {
    LOG(INFO, "[WS %s] Disconnected", name().c_str());
  }
  int id()
  {
    return _id;
  }
  std::string name()
  {
    return StringPrintf("%s/%d", ipv4_to_string(_remoteIP).c_str(), _id);
  }
private:
  uint32_t _id;
  uint32_t _remoteIP;
};

// Captive Portal landing page
static constexpr const char * const CAPTIVE_PORTAL_HTML = R"!^!(
<html>
 <head>
  <title>ESP32 Command Station v%s</title>
  <meta http-equiv="refresh" content="30;url='/captiveauth'" />
 </head>
 <body>
  <h1>Welcome to the ESP32 Command Station</h1>
  <h2>Open your browser and navigate to any website and it will open the ESP32 Command Station</h2>
  <p>Click <a href="/captiveauth">here</a> to close this portal page if it does not automatically close.</p>
 </body>
</html>)!^!";

std::mutex webSocketLock;
std::vector<std::unique_ptr<WebSocketClient>> webSocketClients;
WEBSOCKET_STREAM_HANDLER(process_ws);
WEBSOCKET_STREAM_HANDLER(process_wsjson);
HTTP_STREAM_HANDLER(process_ota);
HTTP_HANDLER(process_power);
HTTP_HANDLER(process_config);
HTTP_HANDLER(process_prog);
HTTP_HANDLER(process_turnouts);
HTTP_HANDLER(process_loco);
HTTP_HANDLER(process_outputs);
HTTP_HANDLER(process_sensors);
HTTP_HANDLER(process_remote_sensors);
HTTP_HANDLER(process_s88);

extern const uint8_t indexHtmlGz[] asm("_binary_index_html_gz_start");
extern const size_t indexHtmlGz_size asm("index_html_gz_length");

extern const uint8_t loco32x32[] asm("_binary_loco_32x32_png_start");
extern const size_t loco32x32_size asm("loco_32x32_png_length");

extern const uint8_t cashJsGz[] asm("_binary_cash_min_js_gz_start");
extern const size_t cashJsGz_size asm("cash_min_js_gz_length");

extern const uint8_t spectreCssGz[] asm("_binary_spectre_min_css_gz_start");
extern const size_t spectreCssGz_size asm("spectre_min_css_gz_length");

extern const uint8_t normalizeCssGz[] asm("_binary_normalize_min_css_gz_start");
extern const size_t normalizeCssGz_size asm("normalize_min_css_gz_length");

namespace openlcb
{
  extern const size_t CDI_SIZE;
}

class CDIRequestProcessor : public StateFlowBase
{
public:
  CDIRequestProcessor(http::WebSocketFlow *socket, uint32_t req_id
                    , uint64_t node_id, size_t offs, size_t size
                    , string target, string type, string value = "")
                    : StateFlowBase(Singleton<Httpd>::instance())
                    , socket_(socket), req_id_(req_id)
                    , client_(Singleton<esp32cs::LCCStackManager>::instance()->memory_config_client())
                    , nodeHandle_(node_id), offs_(offs), size_(size)
                    , target_(target), type_(type), value_(value)
  {
    start_flow(STATE(send_request));
  }

private:
  uint8_t attempts_{3};
  http::WebSocketFlow *socket_;
  const uint32_t req_id_;
  openlcb::MemoryConfigClient *client_;
  openlcb::NodeHandle nodeHandle_;
  size_t offs_;
  size_t size_;
  string target_;
  string type_;
  string value_;

  Action send_request()
  {
    if (!value_.empty())
    {
      LOG(VERBOSE, "[CDI:%s] Writing %zu bytes from offset %zu"
        , target_.c_str(), size_, offs_);
      return invoke_subflow_and_wait(client_, STATE(response_received)
                                   , openlcb::MemoryConfigClientRequest::WRITE
                                   , nodeHandle_
                                   , openlcb::MemoryConfigDefs::SPACE_CONFIG
                                   , offs_, value_);
    }
    LOG(VERBOSE, "[CDI:%s] Requesting %zu bytes from offset %zu"
      , target_.c_str(), size_, offs_);
    return invoke_subflow_and_wait(client_, STATE(response_received)
                                 , openlcb::MemoryConfigClientRequest::READ_PART
                                 , nodeHandle_
                                 , openlcb::MemoryConfigDefs::SPACE_CONFIG
                                 , offs_, size_);
  }

  Action response_received()
  {
    auto b = get_buffer_deleter(full_allocation_result(client_));
    string response;
    if (b->data()->resultCode)
    {
      --attempts_;
      if (attempts_ > 0)
      {
        LOG_ERROR("[CDI:%s] Failed to execute request: %d (%d "
                  "attempts remaining)"
                , target_.c_str(), b->data()->resultCode, attempts_);
        return yield_and_call(STATE(send_request));
      }
      response =
          StringPrintf(
              R"!^!({"res":"error","error":"request failed: %d","id":%d})!^!"
            , b->data()->resultCode, req_id_);
    }
    else if (value_.empty())
    {
      LOG(VERBOSE, "[CDI:%s] Received %zu bytes from offset %zu"
        , target_.c_str(), size_, offs_);
      if (type_ == "string")
      {
        response =
            StringPrintf(
                R"!^!({"res":"field","target":"%s","value":"%s","type":"string","id":%d})!^!"
              , target_.c_str(), b->data()->payload.c_str(), req_id_);
      }
      else if (type_ == "int")
      {
        uint32_t data = b->data()->payload.data()[0];
        if (size_ == 2)
        {
          uint16_t data16 = 0;
          memcpy(&data16, b->data()->payload.data(), sizeof(uint16_t));
          data = be16toh(data16);
        }
        else if (size_ == 4)
        {
          uint32_t data32 = 0;
          memcpy(&data32, b->data()->payload.data(), sizeof(uint32_t));
          data = be32toh(data32);
        }
        response =
            StringPrintf(
                R"!^!({"res":"field","target":"%s","value":"%d","type":"int","id":%d})!^!"
            , target_.c_str(), data, req_id_);
      }
      else if (type_ == "eventid")
      {
        uint64_t event_id = 0;
        memcpy(&event_id, b->data()->payload.data(), sizeof(uint64_t));
        response =
            StringPrintf(
                R"!^!({"res":"field","target":"%s","value":"%s","type":"eventid","id":%d})!^!"
            , target_.c_str()
            , uint64_to_string_hex(be64toh(event_id)).c_str(), req_id_);
      }
    }
    else
    {
      response =
        StringPrintf(R"!^!({"res":"saved","target":"%s","id":%d})!^!"
                    , target_.c_str(), req_id_);
    }
    response += "\n";
    socket_->send_text(response);

