atanisoft/ESP32CommandStation/main/WebServer.cpp
#ifdef CONFIG_GPIO_OUTPUTS
#define GPIO_OUTPUTS_CFG "true"
#else
#define GPIO_OUTPUTS_CFG "false"
#endif

#ifdef CONFIG_GPIO_SENSORS
#define GPIO_SENSORS_CFG "true"
#else
#define GPIO_SENSORS_CFG "false"
#endif

WEBSOCKET_STREAM_HANDLER_IMPL(process_wsjson, socket, event, data, len)
{
  if (event == http::WebSocketEvent::WS_EVENT_TEXT)
  {
    uint64_t node_id =
      Singleton<esp32cs::LCCStackManager>::instance()->node()->node_id();
    string response = R"!^!({"res":"error","error":"Request not understood"})!^!";
    string req = string((char *)data, len);
    cJSON *root = cJSON_Parse(req.c_str());
    cJSON *req_type = cJSON_GetObjectItem(root, "req");
    cJSON *req_id = cJSON_GetObjectItem(root, "id");
    if (req_type == NULL || req_id == NULL)
    {
      // NO OP, the websocket is outbound only to trigger events on the client side.
      LOG(INFO, "[Web] Failed to parse:%s", req.c_str());
    }
    else if (!strcmp(req_type->valuestring, "nodeid"))
    {
      std::string value = cJSON_GetObjectItem(root, "value")->valuestring;
      if (Singleton<esp32cs::LCCStackManager>::instance()->set_node_id(value))
      {
        LOG(INFO, "[Web] Node ID updated to: %s, reboot pending"
          , value.c_str());
        response =
          StringPrintf(R"!^!({"res":"nodeid","id":%d})!^!", req_id->valueint);
      }
      else
      {
        response =
          StringPrintf(R"!^!({"res":"error","error":"Failed to update node-id","id":%d})!^!"
                     , req_id->valueint);
      }
    }
    else if (!strcmp(req_type->valuestring, "info"))
    {
      const esp_app_desc_t *app_data = esp_ota_get_app_description();
      const esp_partition_t *partition = esp_ota_get_running_partition();
      response =
        StringPrintf(R"!^!({"res":"info","build":"%s","timestamp":"%s %s","ota":"%s","snip_name":"%s","snip_hw":"%s","snip_sw":"%s","node_id":"%s","s88":%s,"sensorIDBase":%d,"outputs":%s,"sensors":%s,"id":%d})!^!",
            app_data->version, app_data->date
          , app_data->time, partition->label
          , openlcb::SNIP_STATIC_DATA.model_name
          , openlcb::SNIP_STATIC_DATA.hardware_version
          , openlcb::SNIP_STATIC_DATA.software_version
          , uint64_to_string_hex(node_id).c_str()
          , GPIO_S88_CFG, GPIO_S88_BASE, GPIO_OUTPUTS_CFG, GPIO_SENSORS_CFG
          , req_id->valueint);
    }
    else if (!strcmp(req_type->valuestring, "cdi-get"))
    {
      new CDIRequestProcessor(socket, req_id->valueint, node_id
                            , cJSON_GetObjectItem(root, "offs")->valueint
                            , cJSON_GetObjectItem(root, "size")->valueint
                            , cJSON_GetObjectItem(root, "target")->valuestring
                            , cJSON_GetObjectItem(root, "type")->valuestring);
      cJSON_Delete(root);
      return;
    }
    else if (!strcmp(req_type->valuestring, "update-complete"))
    {
      auto b = invoke_flow(Singleton<esp32cs::LCCStackManager>::instance()->memory_config_client()
                         , openlcb::MemoryConfigClientRequest::UPDATE_COMPLETE
                         , openlcb::NodeHandle(node_id));
      response =
          StringPrintf(R"!^!({"res":"update-complete","code":%d,"id":%d})!^!"
                     , b->data()->resultCode, req_id->valueint);
    }
    else if (!strcmp(req_type->valuestring, "cdi-set"))
    {
      size_t offs = cJSON_GetObjectItem(root, "offs")->valueint;
      std::string param_type =
          cJSON_GetObjectItem(root, "type")->valuestring;
      size_t size = cJSON_GetObjectItem(root, "size")->valueint;
      string value = cJSON_GetObjectItem(root, "value")->valuestring;
      string target = cJSON_GetObjectItem(root, "target")->valuestring;
      if (param_type == "string")
      {
        // make sure value is null terminated
        value += '\0';
        new CDIRequestProcessor(socket, req_id->valueint, node_id, offs, size
                              , target, param_type, value);
      }
      else if (param_type == "int")
      {
        if (size == 1)
        {
          uint8_t data8 = std::stoi(value);
          value.clear();
          value.push_back(data8);
          new CDIRequestProcessor(socket, req_id->valueint, node_id, offs, size
                                , target, param_type, value);
        }
        else if (size == 2)
        {
          uint16_t data16 = std::stoi(value);
          value.clear();
          value.push_back((data16 >> 8) & 0xFF);
          value.push_back(data16 & 0xFF);
          new CDIRequestProcessor(socket, req_id->valueint, node_id, offs, size
                                , target, param_type, value);
        }
        else
        {
          uint32_t data32 = std::stoul(value);
          value.clear();
          value.push_back((data32 >> 24) & 0xFF);
          value.push_back((data32 >> 16) & 0xFF);
          value.push_back((data32 >> 8) & 0xFF);
          value.push_back(data32 & 0xFF);
          new CDIRequestProcessor(socket, req_id->valueint, node_id, offs, size
                                , target, param_type, value);
        }
      }
      else if (param_type == "eventid")
      {
        LOG(VERBOSE, "[Web] CDI EVENT WRITE offs:%d, value: %s", offs
          , value.c_str());
        uint64_t data = string_to_uint64(value);
        value.clear();
        value.push_back((data >> 56) & 0xFF);
        value.push_back((data >> 48) & 0xFF);
        value.push_back((data >> 40) & 0xFF);
        value.push_back((data >> 32) & 0xFF);
        value.push_back((data >> 24) & 0xFF);
        value.push_back((data >> 16) & 0xFF);
        value.push_back((data >> 8) & 0xFF);
        value.push_back(data & 0xFF);
        new CDIRequestProcessor(socket, req_id->valueint, node_id, offs, size
                              , target, param_type, value);
      }
      cJSON_Delete(root);
      return;
    }
    else if (!strcmp(req_type->valuestring, "factory-reset"))
    {
      Singleton<esp32cs::LCCStackManager>::instance()->factory_reset();
      Singleton<esp32cs::LCCStackManager>::instance()->reboot_node();
      response =
        StringPrintf(R"!^!({"res":"factory-reset","id":%d})!^!"
                   , req_id->valueint);
    }
    else if (!strcmp(req_type->valuestring, "reset-events"))
    {
      //Singleton<esp32cs::LCCStackManager>::instance()->reset_events();
      response =
        StringPrintf(R"!^!({"res":"reset-events","id":%d})!^!"
                   , req_id->valueint);
    }
    else if (!strcmp(req_type->valuestring, "event"))
    {
      string value = cJSON_GetObjectItem(root, "value")->valuestring;
      uint64_t eventID = string_to_uint64(value);
      Singleton<esp32cs::LCCStackManager>::instance()->stack()->send_event(eventID);
      response =
        StringPrintf(R"!^!({"res":"event","event":"%s","id":%d})!^!"
                   , value.c_str(), req_id->valueint);
    }
    else if (!strcmp(req_type->valuestring, "function"))
    {
      uint16_t address = cJSON_GetObjectItem(root, "address")->valueint;
      uint8_t function = cJSON_GetObjectItem(root, "function")->valueint;
      GET_LOCO_VIA_EXECUTOR(train, address);
      train->set_fn(function, cJSON_IsTrue(cJSON_GetObjectItem(root, "state")));
      response =
        StringPrintf(R"!^!({"res":"function","id":%d,"function":%d,"state":%s})!^!"
                   , req_id->valueint, function
                   , train->get_fn(function) == 1 ? "true" : "false");
    }
    else if (!strcmp(req_type->valuestring, "loco"))
    {
      uint16_t address = cJSON_GetObjectItem(root, "address")->valueint;
      GET_LOCO_VIA_EXECUTOR(train, address);
      auto req_speed = train->get_speed();
      SpeedType direction = req_speed.direction();
      if (cJSON_HasObjectItem(root, "speed"))
      {
        req_speed.set_mph(cJSON_GetObjectItem(root, "speed")->valueint);
      }
      if (cJSON_HasObjectItem(root, "dir"))
      {
        req_speed.set_direction(cJSON_IsTrue(cJSON_GetObjectItem(root, "dir")));
      }
      train->set_speed(req_speed);
      response =
        StringPrintf(R"!^!({"res":"loco","address":%d,"speed":%d,"dir":%s,"id":%d})!^!"
                   , address, (int)req_speed.mph()
                   , req_speed.direction() ? "true" : "false", req_id->valueint);
    }
    else if (!strcmp(req_type->valuestring, "turnout"))
    {
      uint16_t address = cJSON_GetObjectItem(root, "address")->valueint;
      string action = cJSON_GetObjectItem(root, "action")->valuestring;
      string target = cJSON_HasObjectItem(root, "target") ?
          cJSON_GetObjectItem(root, "target")->valuestring : "";
      TurnoutType type = cJSON_HasObjectItem(root, "type") ?
          (TurnoutType)cJSON_GetObjectItem(root, "type")->valueint :
          TurnoutType::NO_CHANGE;
      if (action == "save")
      {
        Singleton<TurnoutManager>::instance()->createOrUpdate(address, type);
      }
      else if (action == "toggle")
      {
        Singleton<TurnoutManager>::instance()->toggle(address);
      }
      else if (action == "delete")
      {
        Singleton<TurnoutManager>::instance()->remove(address);
      }
      response =
        StringPrintf(R"!^!({"res":"turnout","action":"%s","address":%d,"target":"%s","id":%d})!^!"
                   , action.c_str(), address, target.c_str(), req_id->valueint);
    }
    else if (!strcmp(req_type->valuestring, "ping"))
    {
      response =
        StringPrintf(R"!^!({"res":"pong","id":%d})!^!", req_id->valueint);
    }
    else
    {
      LOG_ERROR("Unrecognized request: %s", req.c_str());
    }
    cJSON_Delete(root);
    LOG(VERBOSE, "[Web] WS: %s -> %s", req.c_str(), response.c_str());
    response += "\n";
    socket->send_text(response);
  }
}

esp_ota_handle_t otaHandle;
esp_partition_t *ota_partition = nullptr;
HTTP_STREAM_HANDLER_IMPL(process_ota, request, filename, size, data, length
                       , offset, final, abort_req)
{
  if (!offset)
  {
    esp_log_level_set("esp_image", ESP_LOG_VERBOSE);
    ota_partition = (esp_partition_t *)esp_ota_get_next_update_partition(NULL);
    esp_err_t err = ESP_ERROR_CHECK_WITHOUT_ABORT(
      esp_ota_begin(ota_partition, size, &otaHandle));
    if (err != ESP_OK)
    {
      LOG_ERROR("[WebSrv] OTA start failed, aborting!");
      Singleton<OTAMonitorFlow>::instance()->report_failure(err);
      request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
      *abort_req = true;
      return nullptr;
    }
    LOG(INFO, "[WebSrv] OTA Update starting (%zu bytes, target:%s)...", size
      , ota_partition->label);
    esp32cs::disable_track_outputs();
    Singleton<OTAMonitorFlow>::instance()->report_start();
  }
  HASSERT(ota_partition);
  ESP_ERROR_CHECK(esp_ota_write(otaHandle, data, length));
  Singleton<OTAMonitorFlow>::instance()->report_progress(length);
  if (final)
  {
    esp_err_t err = ESP_ERROR_CHECK_WITHOUT_ABORT(esp_ota_end(otaHandle));
    if (err != ESP_OK)
    {
      LOG_ERROR("[WebSrv] OTA end failed, aborting!");
      Singleton<OTAMonitorFlow>::instance()->report_failure(err);
      request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
      *abort_req = true;
      return nullptr;
    }
    LOG(INFO, "[WebSrv] OTA binary received, setting boot partition: %s"
      , ota_partition->label);
    err = ESP_ERROR_CHECK_WITHOUT_ABORT(
      esp_ota_set_boot_partition(ota_partition));
    if (err != ESP_OK)
    {
      LOG_ERROR("[WebSrv] OTA end failed, aborting!");
      Singleton<OTAMonitorFlow>::instance()->report_failure(err);
      request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
      *abort_req = true;
      return nullptr;
    }
    LOG(INFO, "[WebSrv] OTA Update Complete!");
    Singleton<OTAMonitorFlow>::instance()->report_success();
    request->set_status(HttpStatusCode::STATUS_OK);
    return new StringResponse("OTA Upload Complete", MIME_TYPE_TEXT_PLAIN);
  }
  return nullptr;
}

HTTP_HANDLER_IMPL(process_power, request)
{
  string response = "{}";
  request->set_status(HttpStatusCode::STATUS_OK);
  if (request->method() == HttpMethod::GET)
  {
    response.assign(esp32cs::get_track_state_json());
  }
  else if (request->method() == HttpMethod::PUT)
  {
    if (request->param(JSON_STATE_NODE, false))
    {
      esp32cs::enable_ops_track_output();
    }
    else
    {
      esp32cs::disable_track_outputs();
    }
  }
  return new JsonResponse(response);
}

HTTP_HANDLER_IMPL(process_prog, request)
{
  request->set_status(HttpStatusCode::STATUS_OK);
  if (!request->has_param(JSON_PROG_ON_MAIN))
  {
    request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);
  }
  else if (request->method() == HttpMethod::GET)
  {
    if (request->param(JSON_PROG_ON_MAIN, false))
    {
      request->set_status(HttpStatusCode::STATUS_NOT_ALLOWED);
    }
    else if (request->has_param(JSON_IDENTIFY_NODE))
    {
      int16_t decoderConfig = readCV(CV_NAMES::DECODER_CONFIG);
      if (decoderConfig > 0)
      {
        uint16_t decoderAddress = 0;
        string response = "{";
        if ((decoderConfig & DECODER_CONFIG_BITS::DECODER_TYPE) == DECODER_CONFIG_BITS::DECODER_TYPE)
        {
          uint8_t decoderManufacturer = readCV(CV_NAMES::DECODER_MANUFACTURER);
          int16_t addrMSB = readCV(CV_NAMES::ACCESSORY_DECODER_MSB_ADDRESS);
          int16_t addrLSB = readCV(CV_NAMES::SHORT_ADDRESS);
          if (addrMSB >= 0 && addrLSB >= 0)
          {
            if (decoderManufacturer == 0xA5)
            {
              // MERG uses 7 bit LSB
              decoderAddress = (uint16_t)(((addrMSB & 0x07) << 7) | (addrLSB & 0x7F));
            }
            else if(decoderManufacturer == 0x19)
            {
              // Team Digital uses 8 bit LSB and 4 bit MSB
              decoderAddress = (uint16_t)(((addrMSB & 0x0F) << 8) | addrLSB);
            }
            else
            {
              // NMRA spec shows 6 bit LSB
              decoderAddress = (uint16_t)(((addrMSB & 0x07) << 6) | (addrLSB & 0x1F));
            }
            response += StringPrintf("\"%s\":\"%s\",", JSON_ADDRESS_MODE_NODE
                                   , JSON_VALUE_LONG_ADDRESS);
          }
          else
          {
            LOG(WARNING, "[WebSrv] Failed to read address MSB/LSB");
            request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
          }
        }
        else
        {
          if ((decoderConfig & DECODER_CONFIG_BITS::SHORT_OR_LONG_ADDRESS) == DECODER_CONFIG_BITS::SHORT_OR_LONG_ADDRESS)
          {
            int16_t addrMSB = readCV(CV_NAMES::LONG_ADDRESS_MSB_ADDRESS);
            int16_t addrLSB = readCV(CV_NAMES::LONG_ADDRESS_LSB_ADDRESS);
            if (addrMSB >= 0 && addrLSB >= 0)
            {
              decoderAddress = (uint16_t)(((addrMSB & 0xFF) << 8) | (addrLSB & 0xFF));
              response += StringPrintf("\"%s\":\"%s\",", JSON_ADDRESS_MODE_NODE
                                     , JSON_VALUE_LONG_ADDRESS);

